KanatERPSukhova.КанатАдаптация/src/Documents/СчетНаОплатуКлиенту/СчетНаОплатуКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7deae7a3-c5c6-4e3a-8a69-ee8c92e40c9a">
  <name>СчетНаОплатуКлиенту</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38171f51-f270-4a82-a089-b63c611c4f1e">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ФормаОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ИспользоватьФормуОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_Товары</name>
    <comment>Задача 000000222</comment>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияДоИзмененияОбновлениемИБ</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловКСписаниюВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисленныхБонусныхБалловВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <comment>Из объекта ДокументОснование</comment>
      <type>
        <types>EnumRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПеревозчикПартнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОтгружатьЧастями</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузкиОснования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_ПлатитЗаДоставку</name>
      <type>
        <types>EnumRef.КАНАТ_ПлатитЗаДоставку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/СчетНаОплатуКлиенту/ObjectModule.bsl
&После("ПриУстановкеНовогоНомера")
Процедура КАНАТ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	//++ Гурьев 31.08.23 Изменение номера при создании на основании
	Если ПустаяСтрока(Номер) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СчетНаОплатуКлиенту.Номер КАК НомерСчета
			|ИЗ
			|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
			|ГДЕ
			|	СчетНаОплатуКлиенту.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		МаксНомер = 0;
		Префикс = ДокументОснование.Номер;
		
		Пока Выборка.Следующий() Цикл
			НомерСчета = Число(Прав(Выборка.НомерСчета, 3));
			Если НомерСчета > МаксНомер Тогда
				МаксНомер = НомерСчета;
			КонецЕсли;
		КонецЦикла;
		
		Номер = СтрШаблон("%1-%2", Префикс, Формат(МаксНомер+1, "ЧЦ=3; ЧВН=")); 
	
	КонецЕсли;
	//-- Гурьев 31.08.23
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура КАНАТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда

		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЗаполнитьПоРеализацииТоваров(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом") Тогда
		ЗаполнитьПоВыкупуВозвратнойТарыКлиентом(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВыкупТоваровХранителем") Тогда
		ЗаполнитьПоВыкупуТоваровХранителем(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		ЗаполнитьПоАктуВыполненныхРабот(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		ЗаполнитьПоОтчетуКомитенту(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомиссионераОСписании") Тогда
		ЗаполнитьПоОтчетуКомиссионераОСписании(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ЗаполнитьПоДоговору(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

		//++ НЕ УТКА

		//++ Устарело_Переработка24
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетДавальцу") Тогда
		ЗаполнитьПоОтчетуДавальцу(
		ДанныеЗаполнения,
		ДанныеЗаполнения);
		//-- Устарело_Переработка24
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетДавальцу2_5") Тогда

		ЗаполнитьПоОтчетуДавальцу2_5(ДанныеЗаполнения, ДанныеЗаполнения);

		//-- НЕ УТКА

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтчетКомитентуОЗакупках") Тогда
		ЗаполнитьПоОтчетуКомитентуОЗакупках(
		ДанныеЗаполнения,
		ДанныеЗаполнения);

	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);

	СчетНаОплатуКлиентуЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

	#Вставка 
	// <+БИТ> Руденков_Е.И. 29.03.2024 
	// #000000222, Счет на оплату. 
	ТипОснования = ТипЗнч(ДокументОснование);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипОснования);
	Если ОбъектМетаданных <> Неопределено и Метаданные.Документы.Содержит(ОбъектМетаданных)
		И ОбъектМетаданных.ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
		ОбъектДляЗапроса = "Документ." + ОбъектМетаданных.Имя;
		ЗаполнитьКАНАТ_Товары(ОбъектДляЗапроса);
		Если ОбъектДляЗапроса = "Документ.ЗаказКлиента" Тогда
			ДополнительнаяИнформация = ДокументОснование.ДополнительнаяИнформация;
		КонецЕсли;
	КонецЕсли;
	// <-БИТ> Руденков_Е.И. 29.03.2024
	#КонецВставки
	
КонецПроцедуры

// <+БИТ> Руденков_Е.И. 29.03.2024 
// #000000222, Счет на оплату. 
Процедура ЗаполнитьКАНАТ_Товары(ОбъектДляЗапроса)
	
	//Запрос реализиован следующим образом, т.к. ДокументОснование может быть разных типов
	//с разным набором реквизитов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ *
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ТЧТовары
	|ГДЕ
	|	ТЧТовары.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ *
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &ДокументОснование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"Документ.ЗаказКлиента.Товары",ОбъектДляЗапроса+".Товары");
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	МассивРезультатов	= Запрос.ВыполнитьПакет();
	РезультатТЧ			= МассивРезультатов[0];
	РезультатОбъект		= МассивРезультатов[1];
	
	ВыборкаОбъект	= РезультатОбъект.Выбрать();
	ВыборкаОбъект.Следующий();
	
	ВыборкаТЧ		= РезультатТЧ.Выбрать();
	Пока ВыборкаТЧ.Следующий() Цикл
		НоваяСтрока = КАНАТ_Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаТЧ);
		Если ОбъектДляЗапроса = "Документ.ЗаказКлиента" Тогда
			НоваяСтрока.СпособДоставки			= ВыборкаОбъект.СпособДоставки;
			НоваяСтрока.ПеревозчикПартнер		= ВыборкаОбъект.ПеревозчикПартнер;
			НоваяСтрока.Грузополучатель			= ВыборкаОбъект.Грузополучатель;
			НоваяСтрока.НеОтгружатьЧастями		= ВыборкаОбъект.НеОтгружатьЧастями;
			НоваяСтрока.ДатаОтгрузкиОснования	= ВыборкаОбъект.ДатаОтгрузки;
			НоваяСтрока.АдресДоставки			= ВыборкаОбъект.АдресДоставки;
			НоваяСтрока.КАНАТ_ПлатитЗаДоставку	= ВыборкаОбъект.КАНАТ_ПлатитЗаДоставку;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // <-БИТ> Руденков_Е.И. 29.03.2024
